Tekla Open API Reference for Tekla Structures 2025
AnalysisModelDesignProperties.ConcreteDesign Property
 The concrete code used.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AnalysisDesignCode ConcreteDesign { get; set; }
Public Property ConcreteDesign As AnalysisDesignCode
	Get
	Set
Property Value
Type: AnalysisDesignCode
See Also
Reference
AnalysisModelDesignProperties Class
Tekla.Structures.Analysis Namespace